Rycbartbad/4ES/sdkconfig.defaults.sensor
# ESP-LEGO sensor submodule firmware defaults
CONFIG_DEVICE_ROLE_SENSOR=y
# CONFIG_DEVICE_ROLE_MASTER is not set

# Sensor runs on ESP32-C3 (RISC-V), master on ESP32-S3
CONFIG_IDF_TARGET="esp32c3"

# Sensor firmware doesn't need Web Console
# CONFIG_WEB_CONSOLE_ENABLED is not set

# Sensor module name (used in announce packets)
# Master assigns module_id dynamically upon connection.
# Override for fixed identity:
#   CONFIG_SENSOR_MODULE_NAME="kitchen_temp"
CONFIG_SENSOR_MODULE_NAME="doorbell"
